{
  "document": {
    "fileId": "06ff3907-9d71-4fc8-a6da-3f52371d966e",
    "filename": "ec73f583bf33_1761643035.pdf",
    "status": "imported",
    "sourceType": "upload",
    "mimeType": "application/pdf",
    "fileSizeBytes": 2706740,
    "contentHash": "d70bedec640b9be8d019260dd1f452e132a921df360b091bc429151e3defd4ff",
    "clientId": "test",
    "uploadedAt": "2025-10-28T12:24:40.907Z"
  },
  "file": {
    "originalPath": "/Users/johanjosok/Documents/Code/research-tool/files/uploads/1761654280852_g8kb3f_ec73f583bf33_1761643035.pdf",
    "exists": true,
    "actualSize": 2706740,
    "createdAt": "2025-10-28T12:24:40.853Z",
    "modifiedAt": "2025-10-28T12:24:40.905Z"
  },
  "extraction": {
    "extractedAt": "2025-10-28T12:25:24.854Z",
    "extractionTime": 163,
    "contentType": "application/pdf",
    "text": "\n\nDevelopment in  \nthe Future of Work\n2025 Perspective on Evolving Trends in L&D\nMcKinsey’s Research and Innovation Learning Lab\nReimagined: \n\nA navigational tool  \nfor the trends of tomorrow\nIn a world defined by constant disruption – economic volatility, geopolitical tension, \nrapid technological advancement, and widespread organizational change, boundaries \nare rapidly blurring. Roles, systems, and scopes of influence that once seemed defined \nor distinct – learning vs operations, people vs technology, work vs life – are now \ninterdependent, overlapping, and inextricably linked. To succeed in this new paradigm, \nthe solutions too must be interdependent.\nIt’s no longer enough for organizations and individuals to simply bounce back from \nchange or even to establish a new working order. Instead, they must learn to bounce \nforward, to reimagine how work gets done, how people learn and develop, and how \norganizations function as resilient, adaptive systems. Doing so requires more than \ntrend-spotting; it requires a commitment to evolving the very models, tools, and \nmindsets we use to navigate the future of work.\nFor this reason, we have transitioned this document from a trends digest to a \nnavigational tool. The three themes explored in this report – fluid development \necosystems, responsible AI adoption, and adaptability and resilience – are not \nstandalone topics, nor are the sub-trends that we explore within each. These three \nmacrotrend areas represent fundamental shifts in how people development is defined, \ndelivered, and sustained across organizations. \nThese trends are mutually reinforcing and cannot succeed in isolation: resilient \norganizations are better equipped to adopt emerging technologies; technology used \nwisely can foster connection, creativity, and care; and integrated operating models \nbreak down silos to make all of this possible. Together, they demand a holistic, forward-\nlooking approach, one that sees development as an act of care, treats resilience and \nadaptability as a shared responsibility, and embraces transformation not as a future \nstate but as a permanent and positive condition.\nIt is essential that organizations see development as an act of care, treat resilience  \nand adaptability as a shared responsibility, and embrace transformation not as a future \nstate but as a permanent and positive condition.\n12025 Learning Trends  Analysis\n\nAbout the 2025 Learning  \nTrends Perspective\nThe McKinsey Research and Innovation (R&I) Learning \nLab reviewed 45+ global trend reports that transcend \nindustries including learning, psychology, HR, tech, finance, \ngeopolitics, travel, and design. \nThe research team consisted of senior leaders and experts \nin L&D, People Analytics, Talent Attraction, and McKinsey’s \nPeople and Organization practice. Following our initial \nanalyses, we clustered commonalities, summarized our \ndetailed data, conducted debates, identified the impact to \npeople development, and constructed our perspectives. \nOur 2025 visuals represent an adaptive, living network\nThe flowing lines and interconnected spheres reflect the \nreport’s themes of integration and progress. The hero \nimage and section dividers showcase dynamic pathways. \nThey symbolize the fluid movement and synergy among \npeople development professionals, as well as the seamless, \neffective journeys employees will experience when acquiring \nnew skills and knowledge in the future.\nThis also represents the evolution of development, as it must \nbe adaptive, continuous, and embedded “in the flow of work” \nto support a rapidly changing landscape.\nAI Agent team members\nThe research team was assisted by AI agents throughout \nthe process and helped in resource identification, clustering, \nand copy-editing. While the agents were considered thought \npartners, human team members were responsible for theme \nand trend selection, developing the perspectives,  \nand writing.\nThrough an extensive \nanalysis of trends \ndisrupting the globe, we \ndevelop a deep perspective \non how these trends will \nimpact the future of people \ndevelopment.\n22025 Learning Trends  Analysis\n\nReimagined development in the future of work\nActing on today’s trends, tomorrow’s people development organizations will feature fluid development ecosystems, adopt AI \nresponsibly and build resilience and agility for individuals and organizations.\nIn a world marked by constant \nchange, blurred boundaries, and rising \nexpectations, we must design work to be \ninherently developmental. Achieving this \nrequires shifting from rigid structures to \na dynamic, interconnected ecosystem \nthat  uses meaningful data and fosters \ncontinuous learning, adaptability, and \ncollaboration. Leaders must:\nThis is a defining moment for the next era \nof work and learning. But trust is fragile, \nand mishandling this moment could erode \nconfidence. The path to responsible AI \nadoption must send a clear message \nto employees that leaders care about \ntheir contributions and are committed to \nensuring that AI will help them succeed. \nLeaders must:\nThe organizations that thrive will not be \nthose that resist disruption or merely \nrecover from setbacks, but the ones \nthat anticipate challenges, adapt, and \ngrow. To do this, they must reimagine \nwork environments and build structural \nand cultural foundations that support \nadaptability and resilience for their \nemployees. Leaders must: \n —De-silo People functions\n —Create data-driven development \necosystems\n —Make strategic decisions based on \nmeaningful foresight\n —Preserve employee trust to accelerate AI \nadoption\n —Foster collaboration between humans \nand AI\n —Equip employees with higher-order skills\n —Unlock the potential of a diverse, \nmultigenerational workforce\n —Support recuperation to ensure \nsustained performance\n —Enable organizational resilience at- scale \nthrough sustainable workflows\nFluid development ecosystemsResponsible AI adoption\nResilient and adaptable individuals \nand organizations123\n32025 Learning Trends  Analysis\n\nThe future of people development offers an opportunity to bring clarity, hope, and \nprogress to the complexities employees and organizations face today.\nEmployees want a seamless development experience—one that feels natural, supports \ntheir growth, and helps them thrive in a rapidly changing world. Development is one of \nthe greatest acts of care employers can provide. Year after year, evidence reinforces \nthat leaders must demonstrate this care not just as an organizational value but as a \nstrategic imperative for long-term success. To achieve this, learning and development \nmust be woven into every aspect of the employee experience—from recruiting to daily \nwork to feedback—transforming work itself into a catalyst for growth.\nThis requires more than new tools or programs. It demands breaking down silos across \npeople functions, aligning on shared goals, and creating systems that feel frictionless \nand are integrated to the employee experience. When employees see that these \nefforts reduce complexity, foster collaboration, and prioritize their growth, they feel \nsupported by their leaders. And when leaders get this right, they unlock resilience, \ninnovation, and sustainable success for their organizations.\nFluid development \necosystems\nSection 1\n\nEmployees experience more in-the-moment learning \nsupport with AI agents playing a growing role - guiding \npractice, coaching through tasks, and supporting \nreal-time reflection. Skills take center stage, and \norganizations are starting to move beyond self-reported \ndata, toward a more complete picture of skill validation. \nStill, learning often feels like something you stop work to \n“go away and do,” rather than something that happens \nnaturally in the flow of daily activities. Learning is closer \nto the workflow than it’s ever been before, but it’s not yet \nembedded.\nPeople development professionals are feeling a growing \nmomentum to break down silos. Teams spot more \nopportunities to collaborate across L&D, talent, HR, and \nother people functions, and that shared energy creates \nideas for new possibilities.\nDespite this progress, L&D still finds itself in a reactive \nstance, often treated more as a support function rather \nthan a strategic partner. Structures and decision rights \ncontinue to reinforce old boundaries. The fences haven’t \nfallen; they’ve just shifted.\nAI augments work in powerful ways, but the real  \nunlock —cohesive, strategic impact— still lies ahead.\nReal, but not radical, progress \ntowards fluid development\nGrowth is the shared purpose of all People \nfunctions. The boundary between learning and \nwork has disappeared. The goal is no longer to add \nlearning into the flow of work - it’s to merge work \nand development. Daily work is now designed as \na developmental engine. Instead of asking how \nto encourage employees to make time to learn, \norganizations are now asking: How do we make daily \nchallenges catalysts for growth?\nEmployees rarely step away from work to upskill - they \ngrow through the work itself. Tasks are designed to \nstretch employees, build new skills, and offer just \nenough challenge without overwhelm. AI copilots act \nas real-time mentors, adjusting their support based on \nperformance, stress, and cognitive load. Learning is \ncontinuous, highly personal, and largely invisible.\nLearning teams collaborate with product, operations, \nand talent to embed growth into workflows. Data and \nanalytics play a central role, helping teams interpret \nindividual performance and progression and adjust the \nsystems and tools in real time. Foresight helps stretch \ntoday’s work towards tomorrow’s skill needs.\nPeople functions operate \nas one. Silos dissolve\nToday\nTomorrow\n\nDe-siloed people  \nfunctions\nOrganizations are striving to become skills-based—using skills as the foundation of talent \nprocesses to build a more agile, adaptive workforce. Achieving this vision requires embedding \nskills development into the flow of work and breaking down silos between HR, L&D, and \nother people functions to create a unified, skills-centric approach. Yet progress remains \nslow. A 2023 ATD survey found that while 72% of respondents recognize the importance of \ntransforming HR into a cross-functional discipline, only 11% report meaningful progress.\n1\nBreaking these silos down is essential to merging learning and work. This will enable \nemployees to develop skills dynamically as part of their roles. To move forward, organizations \nmust replace fragmented, function-specific processes with cohesive systems that integrate \nlearning, talent, and workforce planning. \nChange management is critical: while 83% of leaders believe leadership is key to the skills-\nbased transition, only 28% of employees feel the strategy is being clearly communicated.\n2\n \nBridging this gap requires active engagement, transparency, and collaboration across all \npeople functions. Ultimately, de-siloing people functions is more than a structural change—\nit’s a mindset shift. By aligning around skills as the currency of the future, organizations can \nunlock the agility, innovation, and resilience needed to thrive in the rapidly evolving  \nworld of work.\n62025 Learning Trends  Analysis\n\nCreate data-driven \ndevelopment ecosystems\nAs organizations rethink their operating models, people development must shift from a \nsupport function to a strategic business driver. Central to this change is the use of purposeful, \nactionable data - not just tracking course completions or attendance, but leveraging \nanalytics to understand impact, track growth, and identify skill gaps and high-performing \nemployees.\n3\n To stay relevant, L&D must adopt capabilities like predictive modelling and impact \nvisualization,\n4\n offering employees personalized insights into their own development and tying \nlearning more directly to business outcomes. \nThis evolution is powered by a convergence of new technologies (e.g., AI, LLMs), integrated \nsystems (e.g., HRIS), and changing workforce expectations. Learning measurement must \nmove beyond measuring events to becoming full data ecosystems that track what’s being \nlearned, how, and toward what goals. When data flows across functions and to the individual, \nit supports smarter talent decisions and continuous, in-the-flow-of-work development. As \npeople data becomes more integrated, accessible, and reflective of all types of learning, it will \nhelp to support more resilient and agile organizations.  \n72025 Learning Trends  Analysis\n\nMake strategic \ndecisions based on \nmeaningful foresight\nAccording to the World Economic Forum’s Future of Jobs report, 39% of existing skill sets \nwill be transformed or become outdated between 2025 and 2030.\n5\n Talent and development \nprofessionals are already aware of this ongoing ‘skill instability,’ but the pressure has \nincreased. They’re now responsible for finding, assessing, and validating talent and skills \nfrom broader, more complex candidate pools—while also defining the individual value of each \nnew skill, technology, or change their organization adopts.\n6,7\n Yet despite this awareness, most \norganizations remain in a reactive state. 61% still plan their workforce strategy only one year \nout,\n8\n leaving little space for meaningful foresight. \nThe challenge isn’t just predicting what’s next, it’s making sense of what’s emerging and \nturning those insights into a long-term development strategy. This can no longer be done in \nsilos. People development leaders across functions must collectively shift from short-term \nforecasting to collaborating based on meaningful foresight. Leaders and teams must build \nthe capability to interpret signals from multiple sources—labor trends, technological shifts, \neconomic changes, geopolitics—and use them to shape development ecosystems that flex, \nadapt, and grow.\n82025 Learning Trends  Analysis\n\n“In a tech-powered future, people management \nwill be much more proactive, data-driven, and \nfluid. Organizations will have the fact base \nthey need to launch interventions such as \nhiring, insourcing, outsourcing, upskilling, or \nreskilling. And these interventions themselves \nwill not be one-off activities—rather, the \npractice of adapting, reallocating, adjusting, \nand improving will become the norm.” \n9\nMcKinsey & Company, February 2025 \n92025 Learning Trends  Analysis\n\n85% of people believe that businesses are obligated \nto “train or reskill” employees so people and societies \nremain competitive due to global uncertainty and \nimpending AI tech disruptions.\n11\nOver the next five years, AI technology could \ncreate 11 million jobs globally while displacing 9 \nmillion. As technologies advance, similar shifts are \nlikely, increasing the urgency for dynamic reskilling \nefforts and predictive measures to stay ahead of these \nchanges.\n12\nEmployees increasingly expect the ability to track \ntheir own skill development. Leveraging skill data \ncan enable dynamic learning ecosystems that adapt in \nreal time to both business needs and individual learner \nprofiles.\n13\nBrandon Hall Group, HR Outlook 2025\nCross-border data flow policies can lead to \ndisjointed employee experiences. When policies vary \nby country, establishing global standards becomes \nchallenging, resulting in inconsistent technology usage \nand development experiences for employees.\n14\nOrganizations need a unified data and innovation \nstrategy. As pressure mounts to identify meaningful \nuse cases for AI and other emerging technologies, \nleaders must avoid impulsive adoption. Instead, \nthey should align a broad set of stakeholders and \ncontinuously monitor and identify future tech \nopportunities that deliver meaningful value.\n15\n“Forward-thinking organizations \nare responding by creating \nskill-development ecosystems. \nThese new approaches combine \nformal learning with experiential \nopportunities, creating more \nengaging and effective paths to \nmastery. We see a bright future for \norganizations that use advanced \nanalytics to anticipate future skill \nneeds. This predictive approach \nallows them to prepare their \nworkforce proactively rather than \nreactively, ensuring they stay \nahead of industry changes” \n10\nAdditional evidence that supports  \nthe need to build development ecosystems\n102025 Learning Trends  Analysis\n\nHow to take action\n —Intentionally form cross-functional working teams to solve organization-wide people challenges\n —Establish strategic groups to regularly monitor and track labor trends, technological shifts, economic changes, geopolitical strategies, \nand internal needs\n —Develop a collective vision on how aggregating development data (e.g., feedback, skill levels, evaluations) may benefit team staffing, \nindividualized learning opportunities, and systemic workstreams\n —Adopt capabilities like predictive modelling and impact visualization for skill development and learning needs\n —Champion a skills-first mindset shift across leadership—not just a structural reorganization\nPeople leadership\n —Bridge gaps between organizational strategy and employee awareness, as well as between leadership goals and employee sentiment \nand readiness\n —Develop rotational apprenticeship programs so employees can work across functions and build adjacent skills\n —Collaborate with formal L&D teams to integrate learning into daily tasks and team interactions\n —Provide employees with regular access to their development data and support them in creating personalized plans\nManagers\n —Request access to meaningful employment data and seek mentorship—formal or informal—for guidance on building  \nfuture-focused skills\n —Use development insights to make informed decisions about areas to prioritize for future skills growth\n —Engage in feedback processes following learning programs or performance evaluation interventions\nIndividual contributors\n\nThis is a defining moment for the next era of how work and learning will be done in \nan organization. \nFor years, we’ve been promised personalized learning, curated expertise, and \nsimplified support structures. Yet, employees are still feeling overwhelmed, fatigued \nby constant change, and unsupported in their development. While people leaders are \nactively experimenting with AI—building AI agents, forming partnerships, and piloting \nnew features—these efforts may create more complexity for employees rather than \ndelivering clear value. \nAt its best, AI has the potential to transform people development: streamlining \noperations, enabling personalized learning at scale, and unlocking higher-order skills. \nBut trust is fragile, and mishandling this moment could erode employee confidence. \nLeaders must now make deliberate choices that prioritize employees’ growth and well-\nbeing while driving organizational impact. The path forward must send a clear message \nto employees: “we care about your development, and we’re committed to using AI  \nto help you thrive.”\nResponsible \nAI adoption\nSection 2\n\nOutside organizational walls, AI innovation surges \nforward at an impressive pace. In the months leading \nup to this report, major LLMs rolled out powerful \nenhancements—such as deep research capabilities and \nreasoning—fueling a new wave of hype. This chaotic \nexternal pace strains people development functions as \nthey continually anticipate shifting talent and skill needs. \nPeople development professionals often find \nthemselves stuck in fragmented experimentation, \nfocused on productivity and speed, yet struggling to \ntranslate AI efforts into clear business and people value.\nMeanwhile, employees grapple with constant directional \nshifts, new and bespoke tech platforms, data privacy \nconcerns, organizational restructuring, and growing \nfears of redundancy due to AI. Skill requirements feel \nuncertain, adding to cognitive strain.\nDespite these challenges, employees remain hopeful \nand trust their employers will responsibly integrate \nAI, reduce workplace noise, and create frictionless \nexperiences that accelerate their growth and \ndevelopment.\nThe costly toll of rapid innovation\nAI’s growth surge slightly tapers and organizations \nlearn to embrace uncertainty and adopt clear, strategic \nopportunities. AI and emerging technologies have \nbecome indispensable allies for people development. \nThe administrative burdens that limited managers’ ability \nto develop talent have faded away, freeing them to \nprovide meaningful feedback and apprenticeship. \nAI’s cross-functional integration unlocks real-time, \nactionable insights from diverse data streams—project \nfeedback, formal feedback, formative assessments, skill \ndata—enabling targeted interventions and personalized \ndevelopment.\nPeople development teams use AI-powered analytics to \nproactively identify, and support, struggling individuals \nand teams and apply science-backed learning \ninnovations at speed and scale.\nEmployees have universal access to learning, seamlessly \nintegrated into everyday work tasks. Employees receive \nand trust the tailored guidance from AI-driven tutors, \non-demand practice, and powerful skill analytics to \naccelerate skill growth and provide transparency on \ntheir progression. \nAI provides clarity and support\nToday\nTomorrow\n\nPreserve employee trust \nto accelerate AI adoption\nMoving fast in the AI innovation race offers competitive advantages—but also introduces \nsignificant risks. For instance, rapid yet siloed experimentation across departments can \nlead to a fragmented and inconsistent employee experience. Employees may resist ongoing \nchange due to psychological barriers—such as perceiving AI as a “black box,” overly \nautonomous, emotionless, or incapable of replacing meaningful human interaction.¹ In addition, \nevolving global AI regulations can slow innovation and complicate the potential promise of \nAI. This could impact opportunities like personalized learning, which depends on accessible \nand integrated talent data.² Trust in business remains relatively strong, but it’s trending \ndownward—and becoming more fragile. When organizations fail to account for these factors, \nthat trust will erode quickly.³\nNow more than ever, L&D and People leaders must take a central role in supporting AI \ninnovation. But working in isolation can make it difficult for employees to connect AI with \npersonal value. To preserve trust and support meaningful adoption, leaders must help \nemployees envision how AI can accelerate their growth and development—not just automate \ntheir work.⁴\n142025 Learning Trends  Analysis\n\nFoster collaboration \nbetween humans and AI\nThe partnership between humans and machines is not just transforming industries—it’s \nfundamentally redefining the nature of work, problem-solving, and innovation. In 2025, \nthis synergy has reached new heights, fueled by AI’s growing ability to analyze complex \ndatasets, automate tasks, and amplify human capabilities. Workers are increasingly offloading \nrepetitive and computationally intensive tasks to AI, unlocking time and capacity for creativity, \ncollaboration, and higher-value contributions. Meanwhile, the rapid evolution of generative \nAI tools has made them more accessible and versatile, empowering organizations to design \ntailored, industry-specific solutions at scale.\n5,6\nTo fully unlock this potential, organizations must go beyond adapting to AI—they must actively \ndesign the future of human-AI collaboration. This means fostering the skills, mindsets, \nand systems that empower people to thrive in partnership with intelligent machines. The \nopportunity isn’t just to push boundaries but to reimagine them entirely, creating a future \nwhere human ingenuity and AI innovation amplify one another.\n152025 Learning Trends  Analysis\n\nEquip employees with \nhigher-order skills\nAI has already surpassed human capabilities in speed, knowledge, and creativity at the \ntask level.\n7\n It can analyze vast datasets, automate workflows, and generate solutions faster \nthan any human. Still, AI remains fundamentally limited: it cannot yet independently set \ndirection, contextualize complexity, or make value-driven decisions.\n7\n These uniquely human \ncontributions—defining purpose, interpreting ambiguity, and applying ethical judgment—\nare essential for ensuring AI serves meaningful goals. However, heavy reliance on AI risks \neroding the very skills that make humans indispensable. As AI takes on more tasks, humans \nmay lose opportunities to practice critical thinking, creativity, and problem-solving. Without \nintervention, this cognitive atrophy could leave organizations less innovative and adaptable.\n8\nOrganizations must foster continuous learning to ensure AI enhances, rather than diminishes, \nhuman capabilities. By equipping employees with the skills to collaborate with AI and tackle \nchallenges it cannot solve, they can safeguard the creativity and judgment needed to drive \nprogress. The goal isn’t just to integrate AI into workflows, but to expand human potential. By \nempowering employees to lead, adapt, and innovate, organizations can unlock the full promise \nof human-AI collaboration—transforming not just tasks, but entire industries.\n162025 Learning Trends  Analysis\n\n“The AI age will shape how all \ncompanies operate. The challenge \nlies in determining how to best use \ntechnology, including to truly simplify—\nwithout losing the unique value that \ncomplexity offers, nor the ability \nfor humans to engage with it.” \n9\nMcKinsey & Company, February 2025 \n172025 Learning Trends  Analysis\n\nAgentic AI will empower workers even more in \ncertain tasks. AI agents use multiple types of models \nand modalities to reason, plan, and carry out goals \non behalf of users. These agents further increase \nproductivity, particularly for less experienced and less \nskilled workers.\n11\nAI is enabling workers to accomplish tasks \ncompletely outside their expertise domains. “Vibe \ncoding” is enabling people with no programming \nknowledge to create scripts and apps entirely through \nprompting LLMs to code for them.\n12\n71% of employees trust their employers to use AI \nethically and responsibly. In McKinsey’s Superagency \nin the Workplace report, employees trust their \nemployers more than other institutions like “universities, \nbig-tech, and startups.”\n13\nFuture Today Strategy Group’s 2025  \nTech Trend Report\nPeople are generally still unclear on how AI will \nshape the future in a positive way.\n14\n From job loss \nconcerns to lack of transparency in AI model training, \nand strong belief (76%) that AI tech will never take \ncreativity away from humans.\n15\nTwo-thirds of global executives say they plan to \nprioritize soft skills. Hiring for uniquely human skills \nis essential, especially those that enable organizational \nagility (e.g., problem solving, adaptability, and \ncollaboration).\n16\nToday’s higher-order skills will also be needed in the \nnext 5 years. Analytical thinking tops the core skills for \n2025, followed by (2) resilience, flexibility, and agility, \n(3) leadership and social influence, (4) creative thinking, \nand (5) motivation and self-awareness.\n17\n“While companies eagerly \ninvest in AI, they often overlook \ncrucial investments in change \nmanagement and employee \nsupport. This oversight could \nlead middle managers to view \nAI as a threat rather than a tool, \nfostering resistance that may \ndramatically slow implementation \nand adoption.” \n10\nAdditional evidence that supports the \nneed to drive responsible AI adoption\n182025 Learning Trends  Analysis\n\nHow to take action\n —Promote a human-centered vision for AI integration, emphasizing how it drives growth and enhances human skills, rather than \nsolely how it increases productivity and efficiency\n —Establish cross-functional governance groups to prevent AI silos, balance innovation speed with organizational trust, and ensure ethical \noversight\n —Train internal systems to assess and reward adaptability, ethics, and experimentation with AI and technology\n —Build AI fluency programs to reduce fear and confusion among employees\n —Champion, celebrate, and reward higher-order human skills like critical thinking, creativity, and problem-solving\n —Translate organizational AI strategy into team-level opportunities aligned with role needs\n —Communicate the human benefits of AI while fostering open discussions about change- and tech-related concerns\n —Design team AI adoption as a series of sequential changes to prevent tech overwhelm\n —Establish opportunities for employees to practice critical thinking and creativity\n —Celebrate success stories of how AI has augmented human contributions and added value at work\n —Share AI tools that have work benefits and provide candid feedback on new organizational tools and platforms\n —Practice using AI tools daily at work, and in personal settings, to explore how they can help individuals to learn, reskill, automate tasks, \nand spark creativity\n —Propose strategies to leadership for reducing overload or clarifying priorities when managing multiple, simultaneous changes\nPeople leadership\nManagers\nIndividual contributors\n\nResilient and \nadaptable individuals \nand orgs\nSection 3\nThe organizations that thrive in the future will not be those that resist disruption or merely \nrecover from setbacks, but those that anticipate, adapt, and grow. To do this, they must build \nthe structural, cultural, and personal foundations that support and foster adaptability and \nresilience for their employees.\nToday’s workforce operates in what the Future Today Institute calls a technology supercycle\n1\n: an era \nof relentless innovation and unpredictable consequences. However, the pace of change is certainly \nnot limited to these advancements or to purely external factors. Workforces across the globe are now \nmade up of an unprecedented diversity of experience, with employees spanning five generations. In \na post-COVID world, the boundaries between personal and professional life have, to a great degree, \nblurred. Expectations regarding life balance have shifted, as burnout and information overload reach \ncritical levels. \nAnd yet, most companies continue to position resilience and its necessary partner, adaptability, as \na personal trait or responsibility. If they wish to develop into the resilient organizations necessary for \nsuccess in the future, companies must create and cultivate structures, cultures, and skill sets that \nsupport the resilience of individual employees.\n\nToday’s world is changing quickly; resilience and \nadaptability are essential. Meanwhile, organizations are \nconstrained by outdated mindsets, team structures, and \nways of working that make resilience and adaptability \na challenge at both the individual and organizational \nlevels.\nThe result is a workforce stretched thin. Burnout is \nwidespread, especially as the boundaries between work \nand life have permanently blurred. A multi-generational \nworkforce brings a wide range of values and \nexpectations. And while many return to physical offices, \nthey carry the weight of broader disruptions: rapid AI \nadvancements, geopolitical volatility, and changing \napproaches to inclusion and belonging.\nYet resilience is framed as something employees must \nmanage alone. Well-meaning workplace responses \noften put additional responsibility on already \noverextended individuals and don’t address the systemic \nissues that contribute to burnout in the first place. \nThe outcome is a troubling disconnect: individuals are \nexhausted and unsupported, and organizations need \nresilience and adaptability to thrive but fail to create the \nconditions for it.\nUnsupported individuals cannot \nsupport strong organizations\nOrganizations view resilience and adaptability as \nshared capabilities that can be intentionally cultivated \nand sustained. Work environments, expectations, \nand processes are designed to support the adaptive \nresilience of both employees and the organization. \nThis support is embedded in the design of work. \nLeaders model adaptability and prioritize well-being \nfor themselves and others as a neuroscience-\nbased foundation for professional success. Evolving \ntechnology is embraced as an ongoing opportunity to \nautomate tasks and enhance the ability to focus, reflect, \nand create. \nVolatility is not seen as an existential threat, but as a \ncatalyst for reinvention. Diversity in experience and \nperspective is celebrated and put into practice through \nmentorship, apprenticeship, cross-generational \ncollaboration, and inclusive lifestyle policies. Work \nenvironments and workflows are designed to allow \nample time for recuperation as a necessary element \nof sustained performance. “Work” and “life” are \nunderstood to be interconnected, as are the adaptability \nand resilience capacities of individuals and the \norganizations they power.\nIndividuals and organizations \nare flexible, rooted, and resilient\nToday\nTomorrow\n\nUnlock the potential of a \ndiverse, multigenerational \nworkforce\nWith five generations working side-by-side, today’s workforce is more age-diverse than ever\n2\n \n– and that diversity is reshaping how organizations must learn, lead, and develop talent. Gen \nZ, Millennials, and Gen X now form the largest employee segments,\n3,4\n and many Boomers \ncontinue working.\n5,6\n This generational mix brings valuable perspectives, but also tension. \nDifferences in communication styles,\n7\n career expectations,\n2,4\n and views on professionalism \n(e.g., work hours, time off, dress codes, remote flexibility)\n4\n are fueling conflict, and at times, \nincivility.\n8\n Yet a shared desire for purpose and impact cuts across all age brackets.\n9,10\n Many \nemployees are also driving grassroots innovation, utilizing their own AI tools and platforms.\n11,12\n \nThis bottom-up shift in knowledge-sharing is transforming how organizations operate. \nMeanwhile, companies report that identifying and preparing the leaders of tomorrow remains \nan urgent challenge.\n13\nLearning and development must become dynamic and continuous. Upskilling alone \nis not enough; reskilling will be essential. Leaders should promote cross-generational \napprenticeship and reengineer work environments. The goal should not be static mastery, \nbut rather enduring curiosity and receptivity to change. Intentionally-designed, in-the-flow-\nof-work learning will be critical to meeting the needs of a diverse workforce and to bolstering \nadaptability and resilience.\n222025 Learning Trends  Analysis\n\nSupport recuperation \nto ensure sustained \nperformance\nHigh-performing teams don’t just push through adversity, they strategically recover from it. \nDue to a multitude of factors, including the ongoing swirl of constant change,\n14\n  increasingly \nblurred boundaries,\n15\n excessive stress,\n16\n and changing expectations regarding work,\n2,17\n burnout \nrates are rising.\n18,19\n Studies show that it is impacting workers at younger ages and with more \ndebilitating effects.\n20\nOrganizations must address not only the issue of over-work, but of under-recuperation. \nWithout the systems and structures to restore energy, gain clarity, and renew motivation, \nemployees feel drained and disconnected. This isn’t just a personal wellness issue – it’s a \nproductivity and retention crisis. Burnout erodes team cohesion, innovation, and long-term \norganizational sustainability.\n21\nRecuperation should not be thought of as avoiding responsibility or taking endless PTO. \nRather, it’s an active, strategic approach to restore the foundation necessary for sustained \nperformance. While the world needs those who “run toward the fire” – people willing to \ntackle tough problems with courage and urgency – even elite firefighters don’t battle flames \nnonstop. Recuperation enables people to meet demands, maintain focus, and innovate without \nsacrificing long-term well-being. \n232025 Learning Trends  Analysis\n\nEnable organizational \nresilience at-scale through \nsustainable workflows\nOrganizational resilience – a company’s ability to forecast, manage, and adapt to all manner \nof change – cannot be sustained with a workforce performing at sub-optimal levels.\n21\n Many \ncompanies make efforts to support individuals through resilience-focused benefits like \nmeditation apps or gym memberships.\n22,23\n While these are helpful options that may be well-\nreceived, such offerings can seem like bandages, not effective solutions.\n24\n They don’t go far \nenough to address the root cause of diminishing resilience and continue to put the burden of \nchange disproportionately on individuals. \nAs companies redesign work for AI collaboration and technological augmentation, they \nmust also prioritize creating long-term sustainability for humans. Leaders must work cross-\nfunctionally to set clear priorities, design workflows that support recuperation, and establish \nproject pacing that allows for reasonable autonomy to meet the diverse needs of a changing \nworkforce. AI and other tech can be used to create more flexibility and foster community and \ncreativity. And, while organizations would do well to scout for talent with curiosity, adaptability, \nand resilience, they should also reinforce the importance of these areas through their \nevaluations and reward systems.\nNow is the time to redesign work to create the long-term organizational and individual \nsustainability that will help companies to navigate toward the future.\n242025 Learning Trends  Analysis\n\n“To be resilient, leaders and employees \nneed to view change as a challenge or an \nopportunity to bounce forward, regulate \nthoughts and emotions, take lessons from \nprior experiences, and execute on change. \nTo be adaptable, they need to approach \nuncertainty with an open, learning \nmindset and to think flexibly and \ncreatively about problems as they arise.”\n25\nMcKinsey & Company, December 2024\n252025 Learning Trends  Analysis\n\nEmployee stress is widespread. A Wiley Workplace \nIntelligence report found that nearly all employees \n(96%) are experiencing some level of stress about \nworkplace changes.\n26\n \nWorkers feel overwhelmed. A survey about stress \nin America revealed that 67% of adults ages 18 to \n34 say stress makes it difficult for them to focus, \nand 58% describe their daily stress as “completely \noverwhelming.”\n27\nPeople are looking to “log off” due to tech overload \nand need for balance. In 2024, AirBNB reported \na 100% YOY increase in searched for ‘off-grid \naccomodation.’\n28\nIt has been reported that, on average, 1 in 4 \nemployees within an organization is at high risk \nof burnout.\n29\n The Future of Jobs report indicates \nthat supporting employee health and well-being has \nbecome a top priority for organizations. However, \nemployees placed a much higher value on working \nhours, pointing to a need to go beyond surface-level \nsolutions and address the systemic root causes of this \nproblem.\n30\nMcKinsey& Company, 2022\nThe Future of Jobs Report 2025 predicts that \nresilience, flexibility, and agility will be considered \ncore skills in 2030.\n30\n The reason for this is the pace \nand magnitude of technological change, geopolitical \nfragmentation and economic uncertainty, demographic \nshifts, and the green transition.\nLifelong employment is becoming more widespread. \nDue to economic pressures, aging populations in \ndeveloped countries will increasingly stay in the \nworkforce well past traditional retirement age.”\n31\n This \ntrend, which the World Economic Forum calls “super-\naging societies”, poses global economic and labor-\nmarket challenges.”\n14\nInvesting in employee well-being has significant \neconomic opportunity. According to McKinsey Health \nInstitute, the total global opportunity for optimizing \nemployee health and well-being is $3.7 trillion to $11.7 \ntrillion, which is equivalent to raising global GDP by 4 to \n12 percent.”\n32\n“To cultivate organizational \nresilience and to ensure \nadaptability, companies will \nneed to think differently about \nhow teams are structured and \nmanaged... Adaptable leaders] \npreserve employees’ (and their \nown) energy by emphasizing well-\nbeing versus pushing for 24/7 \nperformance and by serving \nas role models for employees \nunder pressure. [They] enable \norganizational agility and team \nempowerment and ultimately set \nthe tone for resilience.”\n21\nAdditional evidence that supports the need to build \nindividual organizational resilience and adaptability\n262025 Learning Trends  Analysis\n\nHow to take action\n —Design and fund cross-generational apprenticeship and mentorship programs\n —Invest in the leadership development of adaptive, curiosity-driven leaders at all tenure levels\n —Prioritize in-the-flow-of-work learning, reskilling, and tech enablement across the organizations\n —Align the talent strategy lifecycle (e.g., recruitment, evaluations, promotions, and awards) to attract, retain, and reward curiosity, \nadaptability, and resilience\n —Reward leaders who model sustainable work behaviors and build high-performing, well-rested teams\n —Redesign work systems to make resilience a shared priority rather than solely an individual responsibility\nPeople leadership\n —Establish project pacing and communication styles that enable reasonable autonomy\n —Promote collaboration across age groups by staffing projects with intentional diversity\n —Set clear priorities for teams and project plans, allowing time for focused work and recuperation\n —Model resilience, adaptability, and recuperation as a manager and informal coach\nManagers\n —Embrace cross-generational collaboration and engage in apprenticeship/mentorship at all tenure levels\n —Intentionally design resilience practices - like rest, physical movement, and social connection - into the work week\n —Proactively reduce information overload by minimizing notifications, limiting unnecessary screen time, and taking meaningful breaks \naway from the desk\n —Champion and model recuperation as an essential element of high performance\nIndividual contributors\n\nResources\nEveryone and everything that \nhelped develop this report\n\nFrancesca Pacitti\nDirector of Analytics\nRon Rabin\nSenior Expert, \nLearning Design\nNina Rodriguez\nSenior Media  \nDesigner\nJohn Sangimino\nAssociate Director of \nLearning, Design\nJune Zhang\nSenior Manager, \nAnalytics\nDianne Miller\nSenior Expert, \nLearning Design\n292025 Learning Trends  Analysis\nResearchers and authors\nProject ownersContributors\nLisa Christensen\nDirector Learning Design\nNicolas Carr\nHead of Product \nManagement\nPriscilla Fuentes\nAnalyst, Learning  \nDesign\nStephanie Gabriels\nSenior Expert, \nLearning Design\nStef Geiger\nExpert Lead, \nLearning Design\nVeronica Gomez\nExpert, Learning Design\nSandra Durth\nPartner, People & \nOrganization Performance\nJessica Glazer\nExpert, Learning Design\nJake Gittleson\nSenior Expert, \nLearning Design\nTerry Hackett\nAssociate Director of \nLearning, Design\nBob Kaeding\nExpert Lead, \nLearning Design\nKaren Henke\nSenior Expert, \nLearning Design\nSarah Jordaan\nSenior Manager, \nRecruiting\nKaren Merry\nAssociate Director of \nLearning, Design\n\n1. “2024 State of the Industry.” December 2024. ATD Research. https://www.td.org/product/\nresearch-report--2024-state-of-the-industry-talent-development-benchmarks-and-\ntrends/192416\n2. “2024 Work Trend Index Annual Report.” May 8, 2024. Microsoft and LinkedIn. https://www.\nmicrosoft.com/en-us/worklab/work-trend-index/ai-at-work-is-here-now-comes-the-hard-part  \n3. “2025 AI Business Predictions.” 2024. PwC. https://www.pwc.com/us/en/tech-effect/\nai-analytics/ai-predictions.html \n4.   “2025 Consumer Trends.” 2025. Qualtrics. https://success.qualtrics.com/rs/542-FMF-412/\nimages/2025%20Consumer%20Trends%20Report.pdf \n5. “2025 Edelman Trust Barometer Global Report.” 2025. Edelman Trust Institute. https://www.\nedelman.com/trust/25years \n6. “2025 Employee Experience Trends.” 2025. Qualtrics. https://success.qualtrics.com/rs/542-\nFMF-412/images/Qualtrics%202025%20Employee%20Experience%20Trends%20Report.pdf \n7.   “2025 Global Learning & Skills Trends Report.” 2024. Udemy Business. https://info.udemy.com/\nrs/273-CKQ-053/images/Udemy%20Business_2025%20Global%20Learning%20%26%20\nSkills%20Trends%20Report.pdf \n8. “2025 Tech Trends Report.” 2025. Future Today Strategy Group. https://ftsg.com/trends/\n9.   “2025 Webby Trend Report: It’s Giving Brainrot.” November 2024. The Webby Awards. h t t p s : //\nwww.webbyawards.com/wp-content/uploads/sites/4/2024/11/2025-Webby-Trend-Report-Its-\nGiving-Brainrot.pdf \n10. “Accenture Life Trends 2024.” 2024. Accenture Song. https://www.accenture.com/content/dam/\naccenture/final/accenture-com/document-3/Accenture-LifeTrends2025-Report.pdf\n11. “AI + Data Predictions 2025.” 2025. Snowflake. https://www.snowflake.com/en/lp/snowflake-ai-\ndata-predictions/\n12. “AI Business Trends 2025.” 2024. Google Cloud. https://cloud.google.com/resources/ai-trends-\nreport \n13. Alexis Krivkovich, Emily Field, Lareina Yee, Megan McConnell, and Hannah Smith. “Women in the \nWorkplace 2024: The 10th-Anniversary Report.” September 17,2024.  https://www.McKinsey.com/\nfeatured-insights/diversity-and-inclusion/women-in-the-workplace \n14. “Annual Letter: 2025 Macro Themes + 2024 Signals Review.” 2025. Future Today Institute. h t t p s : //\nmailchi.mp/futuretodayinstitute/2024-annual-letter \n15. “Adobe Creative Trends 2025.” 2024. Adobe. https://www.adobe.com/creativecloud/business/\nteams/resources/whitepapers-ebooks/creative-trends-2025-guide-sdk.html\n16. Courtney Rickert McCaffrey, Oliver Jones and Famke Krumbmüller. “2025 Geostrategic Outlook: \nHow Geopolitics is Driving Global Transformation.” December 12, 2024. https://www.ey.com/\nen_us/insights/geostrategy/2025-geostrategic-outlook \n17.  “Culture & Trends Report.” 2024. YouTube. https://www.youtube.com/trends/report/\nfandom-2024/  \n18. Dani Johnson and Heather Gilmartin Adams. “L&D Skills for the Future: Leveling Up.” 2024. Red \nThread Research. \n302025 Learning Trends  Analysis\nGeneral resources: Trend reports\n\n19. “Future of Jobs Report 2025.” January 2025. World Economic Forum. https://reports.weforum.\norg/docs/WEF_Future_of_Jobs_Report_2025.pdf\n20. “Global Talent Trends: Data-Driven Insights into the Changing World of Work.” October 2024. \nLinkedIn Corporation. https://business.linkedin.com/talent-solutions/global-talent-trends \n21. Hannah Mayer, Lareina Yee, Michael Chui and Roger Roberts. “Superagency in the Workplace.” \nJanuary 28, 2025. https://www.mckinsey.com/capabilities/mckinsey-digital/our-insights/\nsuperagency-in-the-workplace-empowering-people-to-unlock-ais-full-potential-at-work\n22. “HR Outlook 2025.” 2025. Brandon Hall Group. https://web.brandonhall.com/hcm_outlook_2025\n23. Kate Rockwood. “7 Trends that Will Shape HR in 2025.” January 14, 2025. https://www.shrm.org/\ntopics-tools/news/hr-quarterly/7-trends-that-will-shape-hr-in-2025\n24. “Job Skills Report.” 2025. Coursera. https://www.coursera.org/skills-reports/job-skills\n25. Julie Jares. “HR Trends to Watch in 2025: Building the Human-Centric Workplace.” January 9, \n2025.  https://blog.workday.com/en-us/hr-trends-to-watch-in-2025-building-the-human-\ncentric-workplace.html \n26. Lareina Yee, Michael Chui, Roger Roberts and Mena Issler. “McKinsey Technology Trends Outlook \n2024.” July 16, 2024. https://www.McKinsey.com/capabilities/McKinsey-digital/our-insights/the-\ntop-trends-in-tech#tech-trends-2024\n2 7. “Leadership Vision for 2025: Top 3 Strategic Priorities for Learning & Development Leaders.” 2024. \nGartner Inc. https://emt.gartnerweb.com/ngw/globalassets/en/human-resources/documents/\ntrends/leadership-vision-for-2025-top-3-strategic-priorities-for-learning-and-development-\nleaders.pdf\n28. “Making Work Better: Insights from ReimagineHR 2024.” 2024. Gartner Inc. h t t p s : //e m t .\ngartnerweb.com/ngw/globalassets/en/human-resources/documents/insights/hrlq-q4-2024.pdf  \n29. “McKinsey Global Institute: 2024 in Charts.” December 12, 2024. McKinsey Global Institute. \nhttps://www.McKinsey.com/mgi/our-research/McKinsey-global-institute-2024-in-charts\n30. Sam Ransbotham, David Kiron, Shervin Khodabandeh, Michael Chu, and Leonid Zhukhov. \n“Learning to Manage Uncertainty, With AI.” November 2024. https://sloanreview.mit.edu/\nwp-content/uploads/2024/11/acf10df25a.pdf\n31. Sarah Barrell and Orla Thomas. “Destination Dupes and Cowboy Core—How Travel Will Look In \n2025.” December 18, 2024. https://www.nationalgeographic.com/travel/article/2025-travel-\ntrends\n32. “State of the AI Connected Customer.” 2024. Salesforce. https://www.salesforce.com/content/\ndam/web/en_us/www/documents/research/State-of-the-Connected-Customer.pdf\n33. Susan Straight. “Top 10 Trends to Watch in 2025.” January 1, 2025. https://www.apa.org/\nmonitor/2025/01/top-10-trends-to-watch\n34. “Talent Trends 2025: Progress Over Perfection.” 2024. Korn Ferry. https://www.kornferry.com/\ncontent/dam/kornferry-v2/featured-topics/pdf/2025-TA-Trends-Report.pdf\n35. “Tech Trends 2025.” 2024. Deloitte Insights. https://www2.deloitte.com/us/en/insights/focus/\ntech-trends.html\n36. “The 2025 AI Index Report.” 2025. Stanford HAI. https://hai.stanford.edu/ai-index/2025-ai-\nindex-report\n312025 Learning Trends  Analysis\nGeneral resources: Trend reports\n\n3 7. “The Future 100: 2025.” January 22, 2025. VML Intelligence. https://www.vml.com/insight/the-\nfuture-100-2025 \n38. “The Global Risks Report 2025.” January 2025. World Economic Forum. https://reports.weforum.\norg/docs/WEF_Global_Risks_Report_2025.pdf\n39. “The Rise of the Superworker: HR and Leadership Predictions and Imperatives For 2025.” January \n2025. The Josh Bersin Company. https://joshbersin.com/superworker/ \n322025 Learning Trends  Analysis\nGeneral resources: Trend reports\n\nSection 1\n1. “2023 State of the Industry.” December 2023. ATD Research. https://www.td.org/\nproduct/p/192311 \n2. “2025 Global Learning & Skills Trends Report.” 2024. Udemy Business. https://info.udemy.com/\nrs/273-CKQ-053/images/Udemy%20Business_2025%20Global%20Learning%20%26%20\nSkills%20Trends%20Report.pdf \n3. Kate Rockwood. “7 Trends that Will Shape HR in 2025.” January 14, 2025.  https://www.shrm.org/\ntopics-tools/news/hr-quarterly/7-trends-that-will-shape-hr-in-2025\n4.   “HR Outlook 2025.” 2025. Brandon Hall Group. https://web.brandonhall.com/hubfs/\nResearch%20Reports%20(Files)/123024_HR_Outlook_2025_Digital.pdf\n5. “Future of Jobs Report 2025.” January 2025. World Economic Forum. https://reports.weforum.\norg/docs/WEF_Future_of_Jobs_Report_2025.pdf\n6. “Workday Global Workforce Report: Restoring Trust Before Your Top People Leave.” 2024. \nWorkday Inc. https://forms.workday.com/en-us/reports/workday-global-workforce-report/form.\nhtml?step=step1_default\n7.   “2025 Global Learning & Skills Trends Report.” 2024. Udemy Business. https://info.udemy.com/\nrs/273-CKQ-053/images/Udemy%20Business_2025%20Global%20Learning%20%26%20\nSkills%20Trends%20Report.pdf \n8. “Top 5 Priorities for HR Leaders in 2025: Actionable Insights to Navigate Challenges and Drive \nBusiness Impact.” 2025. Gartner Inc. https://emt.gartnerweb.com/ngw/globalassets/en/human-\nresources/documents/trends/top-5-priorities-for-hr-leaders-in-2025.pdf\n9.   Asmus Komm, Fernanda Mayol, Neel Gandhi, Sandra Durth, and Jasmin Kiefer. “A New Operating \nModel for People Management: More Personal, More Tech, More Human.” February 7, 2025.  \nhttps://www.mckinsey.com/capabilities/people-and-organizational-performance/our-insights/a-\nnew-operating-model-for-people-management-more-personal-more-tech-more-human\n10. “HR Outlook 2025.” 2025. Brandon Hall Group. Page 12. https://web.brandonhall.com/hubfs/\nResearch%20Reports%20(Files)/123024_HR_Outlook_2025_Digital.pdf\n11. “2025 Edelman Trust Barometer Global Report.” 2025. Edelman Trust Institute. Page 26. h t t p s : //\nwww.edelman.com/trust/25years\n12. “Future of Jobs Report 2025.” January 2025. World Economic Forum. Page 25-26 https://reports.\nweforum.org/docs/WEF_Future_of_Jobs_Report_2025.pdf\n13. “2025 Global Learning & Skills Trends Report.” 2024. Udemy Business. Page 10 https://info.\nudemy.com/rs/273-CKQ-053/images/Udemy%20Business_2025%20Global%20Learning%20\n%26%20Skills%20Trends%20Report.pdf \n14. Børge Brende, Bob Sternfels, et al. “The Global Cooperation Barometer 2025 - Second Edition.” \n2025. World Economic Forum and McKinsey and Company. Page 15. https://reports.weforum.org/\ndocs/WEF_Global_Cooperation_Barometer_2025.pdf \n15. “AI + Data Predictions 2025.” 2025. Snowflake. Pages 5,6,10,22. https://www.snowflake.com/en/\nlp/snowflake-ai-data-predictions/ \n332025 Learning Trends  Analysis\nEndnotes\n\nSection 2\n1. Julian De Freitas. “Why People Resist Embracing AI.” Jan-Feb 2025 Issue. https://hbr.\norg/2025/01/why-people-resist-embracing-ai\n2. “Tech Trends 2025.” 2024. Deloitte Insights. Page 18. https://www2.deloitte.com/us/en/insights/\nfocus/tech-trends.html\n3. “2025 Edelman Trust Barometer Global Report.” 2025. Edelman Trust Institute. https://www.\nedelman.com/trust/25years\n4.   Hannah Mayer, Lareina Yee, Michael Chui and Roger Roberts. “Superagency in the Workplace.” \nJanuary 28, 2025 https://www.mckinsey.com/capabilities/mckinsey-digital/our-insights/\nsuperagency-in-the-workplace-empowering-people-to-unlock-ais-full-potential-at-work \n5. “2024 Work Trend Index Annual Report.” May 8, 2024. Microsoft and LinkedIn. https://www.\nmicrosoft.com/en-us/worklab/work-trend-index/ai-at-work-is-here-now-comes-the-hard-part\n6. “AI Business Trends 2025.” December 2024. Google Cloud. 18-24. https://cloud.google.com/\nresources/ai-trends-report \n7.   “The 2025 AI Index Report.” 2025. Stanford University Human-Centered Artificial Intelligence. \nPage 93. https://hai.stanford.edu/ai-index/2025-ai-index-report\n8. “The Rise of the Superworker: HR and Leadership Predictions and Imperatives For 2025.” January \n2025. The Josh Bersin Company. https://joshbersin.com/superworker/\n9.   “Take a Human-Centric Approach to Avoid AI’s Leadership Traps.” February 10, 2025. Sandra \nDurth, Johanne Lavoie, Dana Maor, and Anna Roth. https://www.mckinsey.com/capabilities/\npeople-and-organizational-performance/our-insights/the-organization-blog/take-a-human-\ncentric-approach-to-avoid-ais-leadership-traps\n10. “2025 Tech Trends Report.” 2025. Future Today Strategy Group. Page 57. https://ftsg.com/trends/ \n11. “AI Business Trends 2025.” December 2024. Google Cloud. Pages 18-24. https://cloud.google.\ncom/resources/ai-trends-report \n12. Preston Fore. “Silicon Valley CEO Says, ‘Vibe Coding’ Lets 10 Engineers Do the Work of 100—\nHere’s How to Use It.” March 26, 2025. https://fortune.com/2025/03/26/silicon-valley-ceo-says-\nvibe-coding-lets-10-engineers-do-the-work-of-100-heres-how-to-use-it/\n13. Hannah Mayer, Lareina Yee, Michael Chui and Roger Roberts. “Superagency in the Workplace.” \nJanuary 28, 2025. https://www.mckinsey.com/capabilities/mckinsey-digital/our-insights/\nsuperagency-in-the-workplace-empowering-people-to-unlock-ais-full-potential-at-work\n14. Julian De Freitas. “Why People Resist Embracing AI.” Jan-Feb 2025 Issue. https://hbr.\norg/2025/01/why-people-resist-embracing-ai \n15. “The Future 100: 2025.” January 22, 2025. VML Intelligence. Page 13. https://www.vml.com/\ninsight/the-future-100-2025\n16. “Global Talent Trends: Data-Driven Insights into the Changing World of Work.” October 2024. \nLinkedIn Corporation. https://business.linkedin.com/talent-solutions/global-talent-trends\n17.  “Future of Jobs Report 2025.” January 2025. World Economic Forum. Pages 35,40. h t t p s : //\nreports.weforum.org/docs/WEF_Future_of_Jobs_Report_2025.pdf \n342025 Learning Trends  Analysis\nEndnotes\n\nSection 3\n1. “2025 Tech Trends Report.” 2025. Future Today Strategy Group. https://ftsg.com/trends \n2. Elizabeth Perry. “5 Generations in the Workplace: How to Manage Them All.” August 3, 2023. \nhttps://www.betterup.com/blog/generations-in-the-workplace\n3. Richard Fry. “Millennials are the Largest Generation in the U.S. Labor Force.” April 11, 2018. h t t p s : //\nwww.pewresearch.org/short-reads/2018/04/11/millennials-largest-generation-us-labor-force/\n4.   Edward Segal. “How Gen Z’s Impact on the Workplace Continues to Grow.” May 24, 2023. h t t p s : //\nwww.forbes.com/sites/edwardsegal/2023/05/24/how-gen-zs-impact-on-the-workplace-\ncontinues-to-grow/\n5. Purdue Global. “Generational Differences in the Workplace.” 2025. https://www.purdueglobal.edu/\neducation-partnerships/generational-workforce-differences-infographic/\n6. Kyle DeMaria, Ian Page, Kevin Reuss, and Zoë Zemper. “Trendlines: Employment and Training \nAdministration.” August 2024. https://www.dol.gov/sites/dolgov/files/ETA/opder/DASP/\nTrendlines/posts/2024_08/Trendlines_August_2024.html#changes-in-the-generational-\ncomposition-of-the-labor-force\n7.   Roy Maurer. “Managing Multi-Generational Communication in the Workplace.” January 2, 2025. \nhttps://www.shrm.org/topics-tools/flagships/all-things-work/managing-multi-generational-\ncommunication-workplace\n8. Kate Rockwood. “7 Trends That Will Shape HR in 2025.” January 14,2025. https://www.shrm.org/\ntopics-tools/news/hr-quarterly/7-trends-that-will-shape-hr-in-2025 \n9.   Ellen Bailey and Cevin Owens. “Unlocking the Benefits of the Multigenerational Workplace.” 2020. \nhttps://www.harvardbusiness.org/wp-content/uploads/2020/08/Unlocking-the-Benefits-of-\nMultigenerational-Workforces_Aug-2020.pdf \n10. Kelly Pledger Weeks. “Every Generation Wants Meaningful Work — But Thinks Other Age \nGroups Are in It for the Money.” July 31, 2017. https://hbr.org/2017/07/every-generation-wants-\nmeaningful-work-but-thinks-other-age-groups-are-in-it-for-the-money\n11. Hannah Mayer, Lareina Yee, Michael Chui, and Roger Roberts. “Superagency in the Workplace.” \nJanuary 28, 2025. https://www.mckinsey.com/capabilities/mckinsey-digital/our-insights/\nsuperagency-in-the-workplace-empowering-people-to-unlock-ais-full-potential-at-work \n12. Adam Zaki. “75% of Employees Use AI at Work: Report.” May 15, 2024. https://www.cfo.com/\nnews/artificial-intelligence-work-linkedin-microsoft-sap/716095/\n13. Ken Taylor and Michelle Eggleston Schwartz. “Trends 2025: Fostering Growth, Resilience \nand Adaptability.” 2024. https://assets.trainingindustry.com/content/uploads/2024/11/\nTrends-2025-1.pdf\n14. Qualtrics. “2025 Employee Experience Trends.” 2025. https://success.qualtrics.com/rs/542-\nFMF-412/images/Qualtrics%202025%20Employee%20Experience%20Trends%20Report.pdf\n15. Natasha Mutebi and Abbi Hobbs. “The Impact of Remote and Hybrid Working on Workers and \nOrganisations.” October 17, 2022. https://post.parliament.uk/research-briefings/post-pb-0049/ \n16. Anna Medaris. “Work is Reaching a Boiling Point.” January 1, 2025. https://www.apa.org/\nmonitor/2025/01/trends-workplace-tensions\n352025 Learning Trends  Analysis\nEndnotes\n\n17.  Edward Segal. “How Gen Z’s Impact on the Workplace Continues to Grow.” May 24, 2023. h t t p s : //\nwww.forbes.com/sites/edwardsegal/2023/05/24/how-gen-zs-impact-on-the-workplace-\ncontinues-to-grow/\n18. Bryan Robinson. “Job Burnout At 66% In 2025, New Study Shows.” February 08, 2025. h t t p s : //\nwww.forbes.com/sites/bryanrobinson/2025/02/08/job-burnout-at-66-in-2025-new-study-\nshows/\n19. Deloitte. “Workplace Burnout Survey.” https://www2.deloitte.com/us/en/pages/about-deloitte/\narticles/burnout-survey.html\n20. Morgan Smith. “Burnout is on the rise worldwide—and Gen Z, young millennials and women are the \nmost stressed.” March 14, 2023. https://www.cnbc.com/2023/03/14/burnout-is-on-the-rise-\ngen-z-millennials-and-women-are-the-most-stressed.html\n21. Dana Maor, Michael Park, and Brooke Weddle. “Raising the Resilience of Your Organization.” \nOctober 12, 2022. https://www.mckinsey.com/capabilities/people-and-organizational-\nperformance/our-insights/raising-the-resilience-of-your-organization\n22. Mike Hesch. “Do Employee Wellness Apps Really Work?” February 11, 2025. https://www.\nbenefitnews.com/opinion/do-employee-wellness-apps-really-work \n23. Hamid Biouaraine, Nabil Ridoini, and Benabdelhadi Abdelhay. “Employee Wellbeing in the \nWorkplace: The Role of HR in Mental Health and Wellness Initiatives.” October 2024. https://www.\nresearchgate.net/publication/385037597_Employee_Wellbeing_in_the_Workplace_The_Role_\nof_HR_in_Mental_Health_and_Wellness_Initiatives\n24. Chris Mosunic. “Do Workplace Wellness Programs Work? Here’s What to Know.” February 2025. \nhttps://www.calm.com/blog/do-workplace-wellness-programs-work \n25. Jacqueline Brassey, Aaron de Smet, and Dana Maor with Sheida Rabipour. “Developing a resilient, \nadaptable workforce for an uncertain future.” December 6, 2024. https://www.mckinsey.com/\ncapabilities/people-and-organizational-performance/our-insights/developing-a-resilient-\nadaptable-workforce-for-an-uncertain-future\n26. Janelle Beck and Tracey Carney. “The Human Side of Artificial Intelligence: 3 Tips for Navigating \nthe AI Era.” September 19, 2024. https://www.everythingdisc.com/blogs/the-human-side-of-\nartificial-intelligence/\n2 7. Kandi Wein. “How Burnout Became Normal — and How to Push Back Against It” April 23, 2024. \nhttps://hbr.org/2024/04/how-burnout-became-normal-and-how-to-push-back-against-it\n28. Sarah Barrell and Orla Thomas. “Destination Dupes and Cowboy Core—How Travel Will Look In \n2025.” December 18, 2024. https://www.nationalgeographic.com/travel/article/2025-travel-\ntrends\n29. Workday, Inc. “Workday Global Workforce Report: Restoring Trust Before Your Top People Leave.” \n2024. https://forms.workday.com/en-us/reports/workday-global-workforce-report/form.html\n30. World Economic Forum. “Future of Jobs Report 2025.” January 2025. https://reports.weforum.\norg/docs/WEF_Future_of_Jobs_Report_2025.pdf\n31. Courtney Rickert McCaffrey, Oliver Jones, and Famke Krumbmüller. “2025 Geostrategic Outlook: \nHow Geopolitics is Driving Global Transformation.” December 12, 2024. https://www.ey.com/\nen_us/insights/geostrategy/2025-geostrategic-outlook\n32. Jacqueline Brassey, “Thriving Workplaces: How Employers Can Improve Productivity and Change \nLives.” https://www.mckinsey.com/mhi/our-insights/thriving-workplaces-how-employers-can-\nimprove-productivity-and-change-lives\n362025 Learning Trends  Analysis\nEndnotes\n\nLearning Lab By McKinsey \n2025 \nCopyright © McKinsey & Company \nDesigned by SJO Design Center\nwww.mckinsey.com\n  @McKinsey \n \n  @McKinsey",
    "metadata": {
      "title": "Development in",
      "pageCount": 38,
      "wordCount": 7718,
      "extractionTime": 160,
      "creator": "Adobe InDesign 20.3 (Windows)",
      "producer": "Adobe PDF Library 17.0",
      "totalPages": 38,
      "contentLength": 61981,
      "originalFileSize": 2706740
    }
  }
}