{
  "document": {
    "fileId": "d44cf2fc-2480-43c6-96eb-51a1755ed6f0",
    "filename": "621319533e2b_1761641679.html",
    "status": "imported",
    "sourceType": "upload",
    "mimeType": "text/html",
    "fileSizeBytes": 155360,
    "contentHash": "5e2051ac475386f5882312729c21888d8c61688b06375c9aa7b1851057e67622",
    "clientId": "test",
    "uploadedAt": "2025-10-28T12:24:40.651Z"
  },
  "file": {
    "originalPath": "/Users/johanjosok/Documents/Code/research-tool/files/uploads/1761654280650_p9fz02_621319533e2b_1761641679.html",
    "exists": true,
    "actualSize": 155360,
    "createdAt": "2025-10-28T12:24:40.651Z",
    "modifiedAt": "2025-10-28T12:24:40.651Z"
  },
  "extraction": {
    "extractedAt": "2025-10-28T13:04:30.881Z",
    "extractionTime": 35,
    "contentType": "text/html",
    "text": "# How today’s consumers are spending their time and money\n\n## More time alone and online\n\n## ‘The least trusted source of information’\n\n## What matters to Gen Z consumers\n\n## Local brands and the value equation\n\n##### Explore a career with us\n\n##### Related Articles\n\n###### State of the Consumer 2025: When disruption becomes permanent\n\n###### An update on US consumer sentiment: Settling in for a tepid holiday season\n\n###### The ‘value now’ consumer: Making sense of US consumer sentiment and spending\n\nPeople are spending more of their time alone and online. Gen Zers don’t feel financially secure but are willing to splurge. In their search for value, shoppers are buying smaller pack sizes or lower quantities of their preferred brands.\n\nThese are some of the trends highlighted in McKinsey’s ConsumerWise research on consumer sentiment and behavior, drawing on a survey of more than 25,000 consumers in 18 countries. Two ConsumerWise leaders discussed the findings on a recent webinar, excerpts of which are featured in this episode of the McKinsey on Consumer & Retail podcast, hosted by Monica Toriello. An edited transcript follows. (For ConsumerWise insights about the upcoming US holiday shopping season, read “An update on US consumer sentiment: Settling in for a tepid holiday season,” and the related podcast episode, “Holiday shopping 2025: US consumers hunt for early deals.”)\n\nMonica Toriello: Hello, everyone. I’m Monica Toriello, an editorial director at McKinsey. We’re excited that you’ve joined us today to hear more about McKinsey’s report, titled State of the Consumer 2025: When disruption becomes permanent. As I’m sure many of you have observed, consumers are doing interesting things; they’re making what seem like paradoxical buying decisions. McKinsey’s ConsumerWise research unpacks some of the underlying motivations and drivers behind these decisions. Today, we have the pleasure of hearing from the two global leaders of our ConsumerWise capability: Christina Adams, a partner in our Dallas office, and Kari Alldredge, a partner based in Minneapolis. They are coauthors of the State of the Consumer report.\n\nKari and Christina, before we dive into the consumer sentiment data, I’d like to ask a high-level question about consumer sentiment data in general. One thing you’ve observed in recent years is a decoupling of consumer sentiment and consumer spending. It used to be that the two were fairly in sync: When sentiment was positive, people spent money—and when they weren’t feeling so great, they didn’t spend as much money. But that has not been the case recently. So, given this divergence, why should companies still pay attention to consumer sentiment? What are the benefits of knowing how consumers are feeling, in an era when how they’re feeling about the economy or about their finances is increasingly divorced from how they’re spending?\n\nKari Alldredge: It’s true that, at the highest level, consumer confidence—which has long been looked at to understand how consumers are feeling, and which had correlated quite closely with consumer spending—is less and less correlated, particularly in the United States and in Western Europe. That makes it only more important to understand consumer sentiment at a much more granular and detailed level. You can’t just depend on confidence. You need to dig deeper: look at it by demographic group, by psychographics, by generation. That’s one reason that we pull in a myriad of different data sources for this report. There’s spending data, foot traffic data, digital data on how consumers are spending their time online. We’re bringing a 360-degree view of the consumer, and that’s fueling much of what you’ll hear today.\n\nChristina Adams: Another thing we have observed is there are different drivers of why people say they are confident or are lacking confidence. Some of those drivers are macroeconomic; some are based on pricing and inflation. And people are reacting differently. Gen Z, for example, is reacting quite differently from other generations. So, again, nuances matter.\n\nMonica Toriello: Let’s get into the five trends that you discuss in your report. The first trend sounds a little depressing: “People are spending more time alone and online.”\n\nKari Alldredge: There has been a remarkable shift in how people spend their time. That behavior that many of us developed during the pandemic, when we had no choice but to be online and alone, really has persisted. This is universal across demographic groups and globally: Consumers report that they have an extra three hours of free time in their week. We were interested to understand what consumers are doing with that free time, and we found that nearly all of it is being spent online and alone in a myriad of different activities—everything from hobbies and fitness to shopping.\n\nWhat are the implications for consumer-facing companies? The first one is pretty obvious: Meet consumers where they are. Eighty percent of surveyed consumers—and again, this is true around the world—shopped online in the last month. So, brands really need to think about their online presence and how they’re showing up online.\n\nThere are other, more subtle implications for companies to consider. One is this notion of immediate gratification. During the pandemic, we all came to expect that we could order something, and it would show up immediately. Consumers are expecting immediate gratification and convenience. We’ve seen about 20 percent annual growth in food delivery over the five years since the pandemic. It’s an explosion of a behavior that was pretty nascent prior to 2020. So, think about ways to reduce barriers and friction.\n\nAlso, particularly for retailers and other experiential consumer-facing companies, thinking about gamification is critical—whether it’s gamifying your loyalty program or finding other ways to engage with consumers online and meet them where they are.\n\nMonica Toriello: Can you give an example of that, Kari? How—or what—are companies gamifying?\n\nKari Alldredge: The best examples I’ve seen are in loyalty programs, whether it’s a direct-to-consumer company or even a brick-and-mortar retailer that makes achieving the next level of status a bit of a game. You can earn points, you see a leaderboard, you get badges for different activities on their site or in their stores.\n\nChristina Adams: Some of that gamification and online interaction then drives in-store behavior. Certainly, there is a growing percentage of online-only shopping, but, by far, the majority of shopping is still omnichannel. It could be discovery or participation online, but purchasing is in store. Those dynamic forms of interaction create some of that interplay between the two, so omnichannel strategy remains important for brands.\n\nMonica Toriello: It seems like there’s some tension between the “online and alone” trend and the next trend you’ll be highlighting, which is about trust in digital channels.\n\nKari Alldredge: Yes, this is one of those great paradoxes that we see in the data. It’s true that consumers are increasingly online and alone—and many of them report that they are discovering and researching products online, and much of that learning happens on social media. But it is also true that social media—and, in particular, influencers on social media—is the least trusted source of information for consumers. That is true around the world and across age and income groups, with the exception of China. It’s a stark paradox.\n\nConsumers increasingly know that many influencers are paid. They also believe that many influencers aren’t even real. In the world of beauty or fashion, consumers understand that many of the images they see are AI-generated, so they’re increasingly distrustful of that information.\n\nThat said, they’re still using it to learn about products. But they’re making decisions based on other sources of information. It reinforces the importance of an omnichannel strategy, as Christina said. So, companies should take another look at traditional media, which, ironically, is a much more trusted source than social media. Thinking about the allocation of your marketing budgets across channels is critically important. In-store tactics—in-store promotions, experiential ways for consumers to touch and see and feel your product—are still very, very important in an omnichannel world.\n\nMonica Toriello: Here’s a question from the audience: “Consumers distrust digital channels, and yet companies are increasing their ad spend on those same channels. What’s your advice to marketers?”\n\nKari Alldredge: I don’t believe that marketers’ budgets have caught up with where consumers’ heads are at. When we did this research just a year ago, the picture looked different: Social media was a more trusted source of information for many consumers. So, my first observation is that these numbers are moving quickly.\n\nThe second thing I would say is that digital is a closed loop, so you can know, in large part, whether your digital marketing is working or not. I would encourage marketers to do more granular research to understand the ROI of their digital spend.\n\nFinally, I recommend thinking more broadly about the allocation of spend and potentially shifting some of it away from social media. To be clear, social commerce is still critically important. What has shifted is consumers’ trust in influencers on social media as a source of truth about the products they buy.\n\nChristina Adams: The other major trend of the past year is the rise of AI. It’s led to a lot of content being created about which consumers, particularly younger consumers, have an inherent skepticism. There are certainly still some established, trusted influencers who remain relevant, especially as a complement to what brands might say themselves. But, as Kari said, influencers in general are not as trusted now as they might have been a year ago.\n\nMonica Toriello: The third trend is about the Gen Z consumer. Christina, tell us more.\n\nChristina Adams: Gen Z is here. As a generation, they are established, fast growing, and fast changing. This is a critical moment in time: Gen Z’s average age now is 22. They range in age from 15 to 29. Since last year, there’s been a 45 percent increase in Gen Zers who are saying they’re married, a 23 percent increase in those with children. And 19 percent of Gen Zers are in decision-making roles at work.\n\nThis generation is fast gaining spending power. They view money differently from generations before them: They care a lot about financial security, but they are willing to splurge—and to splurge quite a bit more than generations before them. We don’t see any sign of that slowing down. We are seeing some shifts in areas that prior generations considered big investments, such as home purchases. Gen Z is investing quite a bit in experiences rather than things. They’re also spending on microexperiences—they’re willing to pay for the cup of coffee that brings them joy at the beginning of the day, or they’re willing to invest in nutrition, which they view as important.\n\nAcross the 18 countries we surveyed, 65 percent of Gen Zers on average—the lowest being about 50 percent in South Korea, all the way up to 85 percent in India, with all other countries landing somewhere in between—say they are willing to splurge in the categories that matter to them. In every single country, Gen Z was the highest-splurging generation.\n\nAnother thing to keep in mind as we talk about these trends is nuance. It’s important to have granular insights on the motivators of Gen Z—particularly where they’re choosing to spend and how they’re choosing to spend. For example, nutrition and wellness matter to Gen Z, but unlike earlier generations, among whom topics like “organic” and “natural” tended to emerge the most, for Gen Z it’s “protein.” That specificity is important. It’s not to say that organic and natural don’t matter, but the trend does take a bit of a different shape with Gen Z compared to prior generations.\n\nAlso, Gen Z uses AI more. They’re skeptical of AI, but they’re also aware of it and engage with it. We’re seeing some brands use AI tools to interface with consumers and reach Gen Z in a very effective way.\n\nMonica Toriello: Another question from the audience: “Why are millennials second priority? Aren’t they a cohort with larger incomes, larger decision-making influence, and more disposable income? Why are we talking about Gen Z all the time?”\n\nChristina Adams: I am a millennial, so I will speak on behalf of my generation. It is certainly not a forgotten generation. It is still the highest-spending generation at this moment in time. That said, millennial behavior at this point looks more similar to Gen X and even, in some aspects, to baby boomers. Millennial behavior is more known and established, and it is changing less quickly than Gen Z behavior.\n\nTo clarify, the data I quoted earlier was the change in Gen Zers who are married or have children. Those are not the absolute numbers, which are still relatively small—but, again, the increase in Gen Z parents every year is large and will continue to be large. So, because they are at a highly malleable point—and because, when they reach a critical age, they are expected to be bigger spenders than millennials—it’s important to understand them with nuance while not losing sight of millennials, Gen X, and also boomers, who are the second-largest spending generation at this point.\n\nKari Alldredge: Gen Z was shaped differently, right? They were college students during the pandemic. That is likely to have lasting implications for them. One way we’re seeing it is in the prioritizing of experiences over things.\n\nAnd there are ways for companies—even companies that make things—to surround their thing with an experience. I’ll give you an example. I was recently in China, doing some work in the “sweet indulgences” category. We found that, among companies that have physical products, the ones growing the fastest—particularly among Gen Zers—are the ones whose products are worthy of being shared on social media. “This confection is so amazing. It costs twice as much as a similar thing, but I am willing to spend double the amount because it is so beautiful, and the way it’s presented is such an experience that I want to post it and share it.” That was eye-opening to me. It’s a great example of how a company that makes a physical product can capitalize on this notion of Gen Z being so interested in splurging, especially on experiences.\n\nMonica Toriello: That’s a good segue to the fourth trend: the growing appeal of local brands.\n\nChristina Adams: Buying local matters. It matters to 47 percent of the people we surveyed. That is a lot—it’s certainly not 90 percent of people, but it does matter. In the EU-5, that number is 52 percent. I should also clarify that when we say “local,” we don’t mean the farmer’s market on the corner. When we say local purchases, we mean domestic brands.\n\nThere are a few reasons why this is evolving. One is certainly tariffs: wanting a secure supply of the products you are purchasing and not having to worry about whether major price changes might be ahead. As for what companies are doing, one is that they’re promoting domestic or locally made products. This trend is also informing M&A strategies, as companies consider partnerships or acquisitions that create access for products within a country’s borders.\n\nMonica Toriello: The fifth trend is that “the value equation is evolving.” What does that mean, Christina?\n\nChristina Adams: This trend ties to a lot of what we’ve been talking about—and it’s important to note that we do think of this as value, not just price. As prices have continued to rise and as inflation remains a relevant topic, we see consumers defining value in a new way. Two of the top three concerns that consumers are talking about are related to prices and inflation.\n\nWe are seeing trade-down behavior continue. And I say that with full recognition that trade-down is an interesting juxtaposition to splurging, which we talked about earlier. Often, we see the same consumer doing both; it’s a matter of which categories they’re doing it in. They trade down in certain categories to enable splurging in others. It’s important to understand the consumer holistically—to understand the occasions and needs that are driving the difference between those behaviors.\n\nI will also say, though, that the top way that consumers trade down is that they will look to purchase the same product, but they will purchase a smaller size or a lower quantity of it. That is different from the 2008 economic downturn, when buying private labels was the top way that consumers traded down. That is certainly still a way that consumers are trading down, but consumers are looking more to preserve behavior but at a lower absolute price point. Consumers are also changing the channels in which they shop. All of this points to revenue growth management [RGM] as an important consideration, particularly in thinking about price-pack architecture, channel strategy, and the overall dynamic ability to reach consumers with a price point that reflects the value they see in the product.\n\nKari Alldredge: One of the most interesting new trends that we’re seeing is this trade-off across categories, as opposed to just within categories. It’s one of the first times in the data that we’re seeing consumers say that they traded down on essential items to enable them to splurge on discretionary items. Understanding the cross-category choices that consumers are making is a different muscle for many companies, which tend to think about value as bounded within their category.\n\nMonica Toriello: You’ve already touched on some of the implications for companies: building a 360-degree view of the consumer is one, investing in RGM is another. What else should companies prioritize?\n\nKari Alldredge: Portfolio shaping is important, whether that’s M&A or divestiture. Reshape your portfolio to lean into places where there is growth—by geography, by consumer segment, and by category. And finally, rewire your tech capabilities to support all this. We didn’t talk a lot about technology, but a couple of important places where we’re seeing that show up are innovation and marketing. For example, using AI to more quickly develop product concepts, get products to market, create marketing content, and understand marketing ROI are ways that companies are investing in technology to respond to these trends.\n\nOctober 16, 2025 | PodcastWhat are the trends shaping consumer sentiment and behavior in 2025—and what are the implications for brands and retailers? (8 pages)\n\nApple PodcastsSpotify\n\nArticleArticleArticle (8 pages)\n\nApple PodcastsSpotify",
    "metadata": {
      "title": "How today’s consumers are spending their time and money",
      "description": "McKinsey ConsumerWise latest research on consumer trends 2025 examines how Gen Z, digital habits, and value shifts are reshaping brand and marketing strategies.",
      "author": "",
      "wordCount": 3043,
      "extractionTime": 32,
      "contentLength": 18777,
      "originalFileSize": 155360
    }
  }
}